test/floaterMotionPotentialFlow/ellipse/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          dynamicMeshDict;
}

dynamicFvMesh   staticFvMesh;

solvers
{
    body
    {
        motionSolverLibs ( floaterMotion );
        motionSolver    floaterMotion;
        floaterMotionCoeffs
        {
            addedMassModel  potentialAddedMass;
            patches         ( floatingObject );
            linDirs         ( 1 1 0 );
            rotDirs         ( 0 0 1 );
        }
    }
}


// ************************************************************************* //
